app/Http/Controllers/EventsController.php

select * from `events`
select * from `workshops` where `workshops`.`event_id` in (1, 2, 3)
---
    public function getEventsWithWorkshops()
    {
        $event = Event::with('workshops')->get()->toArray();

select * from `workshops`
select * from `events` where exists (select * from `workshops` where `events`.`id` = `workshops`.`event_id` and date(`start`) >= '2022-05-14' and `id` = 1)
select * from `workshops` where date(`start`) >= '2022-05-14'
---
    public function getFutureEventsWithWorkshops()
    {
        $Event = Event::with('workshops')->whereHas('workshops' , function ($q) {
             $q->whereDate('start', '>=', date('Y-m-d'));
            $q->where('id',1);
        })->get()->toArray();
        $workshop = Workshop::whereDate('start', '>=', date('Y-m-d'))->get();