app/Http/Controllers/MenuController.php

select * from `menu_items` limit 1
---
    public function getMenuItems()
    {
        $menus = MenuItem::with('children')->first()->toArray();